# ➥ Feature Splitting

In [1]:
import pandas as pd

In [2]:
titanic = pd.read_csv('train.csv')
titanic.head()
titanic = titanic[['Survived','Name']]
titanic

     Survived                                               Name
0           0                            Braund, Mr. Owen Harris
1           1  Cumings, Mrs. John Bradley (Florence Briggs Th...
2           1                             Heikkinen, Miss. Laina
3           1       Futrelle, Mrs. Jacques Heath (Lily May Peel)
4           0                           Allen, Mr. William Henry
..        ...                                                ...
886         0                              Montvila, Rev. Juozas
887         1                       Graham, Miss. Margaret Edith
888         0           Johnston, Miss. Catherine Helen "Carrie"
889         1                              Behr, Mr. Karl Howell
890         0                                Dooley, Mr. Patrick

[891 rows x 2 columns]

In [3]:
titanic['Last Name'] = titanic['Name'].str.split(',',expand=True)[0]

In [4]:
titanic['Title'] = titanic['Name'].str.split(',',expand=True)[1].str.split('.',expand=True)[0]

In [5]:
titanic['First Name'] = titanic['Name'].str.split(',',expand=True)[1].str.split('.',expand=True)[1]

In [6]:
titanic = titanic[['Title','Last Name','First Name','Survived']]

In [7]:
titanic

     Title  Last Name                              First Name  Survived
0       Mr     Braund                             Owen Harris         0
1      Mrs    Cumings   John Bradley (Florence Briggs Thayer)         1
2     Miss  Heikkinen                                   Laina         1
3      Mrs   Futrelle           Jacques Heath (Lily May Peel)         1
4       Mr      Allen                           William Henry         0
..     ...        ...                                     ...       ...
886    Rev   Montvila                                  Juozas         0
887   Miss     Graham                          Margaret Edith         1
888   Miss   Johnston                Catherine Helen "Carrie"         0
889     Mr       Behr                             Karl Howell         1
890     Mr     Dooley                                 Patrick         0

[891 rows x 4 columns]

In [8]:
titanic.groupby('Title')['Survived'].sum().sort_values(ascending=0)

Title
 Miss            127
 Mrs              99
 Mr               81
 Master           23
 Dr                3
 Mlle              2
 Sir               1
 Ms                1
 Mme               1
 the Countess      1
 Col               1
 Major             1
 Lady              1
 Jonkheer          0
 Rev               0
 Don               0
 Capt              0
Name: Survived, dtype: int64